tap "chipmk/tap"
tap "gcenx/apple"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "python@3.12"
brew "adb-enhanced"
brew "automake"
brew "awscli"
brew "awscurl"
brew "awslogs"
brew "bat"
brew "binutils"
brew "bpython"
brew "c"
brew "freetype"
brew "glib"
brew "cairo"
brew "cheat"
brew "choose-gui"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "cmu-pocketsphinx"
brew "codespell"
brew "coreutils"
brew "cowsay"
brew "cpulimit"
brew "dialog"
brew "difftastic"
brew "doggo"
brew "dos2unix"
brew "duti"
brew "dwarf"
brew "e2fsprogs"
brew "e2tools"
brew "exiftool"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "lame"
brew "libass"
brew "ffmpeg"
brew "fftw"
brew "flake8"
brew "fzf"
brew "gh"
brew "ghcup"
brew "glow"
brew "gnupg"
brew "go"
brew "go-jira"
brew "gobject-introspection"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "hblock"
brew "howdoi"
brew "htop"
brew "hub"
brew "imagemagick"
brew "iproute2mac"
brew "ipython"
brew "isort"
brew "jless"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "lzip"
brew "man-db"
brew "mkcert"
brew "yt-dlp"
brew "mpv"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "nvm"
brew "ollama"
brew "openjdk"
brew "openvpn"
brew "p7zip"
brew "tree"
brew "pass"
brew "pidof"
brew "pnpm"
brew "poke"
brew "portaudio"
brew "ptpython"
brew "python@3.10"
brew "python@3.8"
brew "qbittorrent-cli"
brew "ranger"
brew "ripgrep"
brew "rmlint"
brew "rustup"
brew "slackcat"
brew "sleepwatcher", restart_service: true
brew "sox"
brew "speedtest-cli"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tox"
brew "vim"
brew "wget"
brew "zeek"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "chipmk/tap/docker-mac-net-connect"
cask "adobe-dng-converter"
cask "android-platform-tools"
cask "arduino-ide"
cask "cakebrew"
cask "caprine"
cask "db-browser-for-sqlite"
cask "devutils"
cask "firefox"
cask "flameshot"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "hammerspoon"
cask "icanhazshortcut"
cask "imhex"
cask "kitty"
cask "mitmproxy"
cask "ngrok"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "protonvpn"
cask "qbittorrent"
cask "vlc"
cask "wireshark"
cask "zoom"
