tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "adb-enhanced"
brew "automake"
brew "awscli"
brew "awscurl"
brew "awslogs"
brew "bat"
brew "bpython"
brew "freetype"
brew "glib"
brew "cairo"
brew "cheat"
brew "choose-gui"
brew "cmake"
brew "cmake-docs"
brew "codespell"
brew "coreutils"
brew "dialog"
brew "duti"
brew "node"
brew "eslint"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "lame"
brew "libass"
brew "ffmpeg"
brew "fftw"
brew "flake8"
brew "fzf"
brew "gh"
brew "glow"
brew "gnupg"
brew "go"
brew "go-jira"
brew "gobject-introspection"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "hblock"
brew "howdoi"
brew "htop"
brew "hub"
brew "imagemagick"
brew "iproute2mac"
brew "ipython"
brew "isort"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "man-db"
brew "memcached", restart_service: true
brew "mkcert"
brew "mpv"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "openjdk"
brew "openvpn"
brew "p7zip"
brew "tree"
brew "pass"
brew "pidof"
brew "portaudio"
brew "prettier"
brew "ptpython"
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "rmlint"
brew "rust"
brew "slackcat"
brew "speedtest-cli"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tox"
brew "vim"
brew "wget"
brew "yarn"
brew "zeek"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
cask "android-platform-tools"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "hammerspoon"
cask "icanhazshortcut"
cask "kitty"
cask "ngrok"
cask "obsidian"
cask "protonvpn"
cask "vlc"
cask "zoom"
